# FabricSheetMajorStartOverhang Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricSheetMajorStartOverhang Property
ParameterTypeId Class See Also
---
"Major Start Overhang": Major Start Overhang
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricSheetMajorStartOverhang { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetMajorStartOverhang As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricSheetMajorStartOverhang {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace